<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package from a downloaded Jump Desktop download.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.mikestechshop.pkg.JumpDesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JumpDesktop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.1</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.mikestechshop.download.JumpDesktop</string>
    <key>Process</key>
    <array>
        <dict>
        		<key>Processor</key>
        		<string>Versioner</string>
        		<key>Arguments</key>
        		<dict>
        			<key>input_plist_path</key>
	        		<string>%RECIPE_CACHE_DIR%/unpack/Jump Desktop.app/Contents/Info.plist</string>
	        	</dict>
		</dict>
        <dict>
        		<key>Processor</key>
        		<string>AppPkgCreator</string>
        		<key>Arguments</key>
        		<dict>
        			<key>app_path</key>
	        		<string>%RECIPE_CACHE_DIR%/unpack/Jump Desktop.app</string>
	        		<key>pkg_path</key>
	        		<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
	        	</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>