<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package for Iconik Desktop Agent. You MUST specify the architecture (Either x64 or arm64) in your override.</string>
    <key>Identifier</key>
    <string>com.github.mikestechshop.pkg.IconikAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>IconikAgent</string>
        <key>ARCH</key>
        <string>x64 or arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.1</string>
    <key>ParentRecipe</key>
    <string>com.github.mikestechshop.download.IconikAgent</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>Versioner</string>
    		<key>Arguments</key>
    		<dict>
    			<key>input_plist_path</key>
    			<string>%pathname%/iconik Agent.app/Contents/Info.plist</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>AppPkgCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>app_path</key>
    			<string>%pathname%/iconik Agent.app</string>
    			<key>pkg_path</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCH%-%version%.pkg</string>
    		</dict>
    	</dict>
    </array>
</dict>
</plist>