<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Tandem Chat</string>
    <key>Identifier</key>
    <string>com.github.autopkg.mikestechshop.download.TandemChat</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Tandem</string>
        <key>DOWNLOAD_URL</key>
        <string>https://tandem.chat/downloadv3/mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_format</key>
        		<string>zip</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/Unarchiver</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/Unarchiver/%NAME%.app</string>
                <key>requirement</key>
                <string>identifier "tandem.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "W4VPC5PHQ9"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>