<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package for Tandem Chat</string>
    <key>Identifier</key>
    <string>com.github.autopkg.mikestechshop.pkg.TandemChat</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Tandem</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.1</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.mikestechshop.download.TandemChat</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>Versioner</string>
    		<key>Arguments</key>
    		<dict>
    			<key>input_plist_path</key>
    			<string>%RECIPE_CACHE_DIR%/unpack/Tandem.app/Contents/Info.plist</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>AppPkgCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>app_path</key>
    			<string>%RECIPE_CACHE_DIR%/unpack/Tandem.app</string>
    			<key>pkg_path</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
    		</dict>
    	</dict>
    </array>
</dict>
</plist>
