<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download and Package the latest version of Box Notes </string>
	<key>Identifier</key>
	<string>com.github.mikestechshop.pkg.BoxNotes</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BoxNotes</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mikestechshop.download.BoxNotes</string>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/Box Notes.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
