<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Universal Type Client v7 and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.mikestechshop.pkg.UniversalTypeClient7</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.extensis.UniversalTypeClient</string>
		<key>NAME</key>
		<string>UniversalTypeClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.download.UniversalTypeClient7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_format</key>
				<string>zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/zip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/zip/Univeral Type Client 7*.pkg</string>
				<key>extract_root</key>
				<string>%RECIPE_CACHE_DIR%/extract</string>
			</dict>
			<key>Processor</key>
			<string>PkgExtractor</string>
		</dict>
		<!--<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>-->
	</array>
</dict>
</plist>
