<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Universal Type Client v7 and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.mikestechshop.pkg.UniversalTypeClient7</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.extensis.UniversalTypeClient</string>
		<key>NAME</key>
		<string>UniversalTypeClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.download.UniversalTypeClient7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_format</key>
				<string>zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/zip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/zip/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extract</string>
				<key>flat_pkg_path</key>
				<string>%found_filename%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extract_root</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/extract/universalTypeClient.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Process</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/extract_root/Universal Type Client.app/Contents/Info.plist</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
