<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Efficient Elements for Presentations and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.mikestechshop.pkg.EfficientElements</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EfficentElements</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.mikestechshop.download.EfficientElements</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_source</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_source/ee4p.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>XMLReader</string>
			<key>Arguments</key>
			<dict>
				<key>xml_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root/Library/Application Support/Microsoft/Office365/User Content.localized/Add-Ins.localized/Efficient Elements/Efficient Elements for presentations/Program/Program.xml</string>
				<key>elements</key>
				<array>
					<dict>
						<key>attributes</key>
						<dict>
							<key>value</key>
							<string>version</string>
						</dict>
						<key>xpath</key>
						<string>./setting[@name="version"]</string>
					</dict>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>		
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkg_root</string>
					<string>%RECIPE_CACHE_DIR%/pkg_source</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
