<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Asana DMG.

Download URLs
arm64: https://desktop-downloads.asana.com/darwin_arm64/prod/latest/Asana.dmg
x86_64: https://desktop-downloads.asana.com/darwin_x64/prod/latest/Asana.dmg
universal (default): https://desktop-downloads.asana.com/darwin_universal/prod/latest/Asana.dmg
    </string>
    <key>Identifier</key>
    <string>com.github.mikestechshop.download.asana</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Asana</string>
        <key>DOWNLOAD_URL</key>
        <string>https://desktop-downloads.asana.com/darwin_universal/prod/latest/Asana.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Asana.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>(identifier "com.electron.asana" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A679L395M8)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
